tap "adoptopenjdk/openjdk"
tap "bufbuild/buf"
tap "datawire/blackbird"
tap "golangci/tap"
tap "goreleaser/tap"
tap "gromgit/fuse"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "moshebe/gtrace"
tap "moshebe/pkg"
tap "reviewdog/tap"
tap "sachaos/tap"
tap "tclass/cloud_sql_proxy"
brew "act"
brew "asciinema"
brew "aws-shell"
brew "awscli"
brew "bat"
brew "bfg"
brew "csvkit"
brew "curl"
brew "curlie"
brew "dive"
brew "docker", link: false
brew "docker-compose", link: false
brew "docker-credential-helper-ecr", link: false
brew "dog"
brew "duf"
brew "ffmpeg"
brew "flyway"
brew "fswatch"
brew "fzf"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-delta"
brew "git-secrets"
brew "gnupg"
brew "go"
brew "goreleaser"
brew "pango"
brew "graphviz"
brew "grpc"
brew "grpcurl"
brew "helm"
brew "hey"
brew "htmlq"
brew "htop"
brew "httpie"
brew "hugo"
brew "imagemagick"
brew "ipcalc"
brew "iperf"
brew "ipython"
brew "jenv"
brew "jid"
brew "jq"
brew "k3d"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "kubespy"
brew "libpq"
brew "mercurial"
brew "miller"
brew "minikube"
brew "mitmproxy"
brew "mkcert"
brew "mockery"
brew "mutt"
brew "neovim"
brew "nmap"
brew "nnn"
brew "node"
brew "openjdk@11"
brew "pinentry-mac"
brew "postgresql"
brew "protoc-gen-go"
brew "python@3.7"
brew "python@3.8"
brew "qpdf"
brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "sl"
brew "stern"
brew "terraform"
brew "tmate"
brew "tree"
brew "vault"
brew "watch"
brew "wget"
brew "wireshark"
brew "yamllint"
brew "youtube-dl"
brew "yq"
brew "zoxide"
brew "bufbuild/buf/buf"
brew "gromgit/fuse/sshfs-mac"
brew "datawire/blackbird/telepresence-legacy"
brew "golangci/tap/golangci-lint"
brew "heroku/brew/heroku"
brew "moshebe/pkg/gtrace"
brew "reviewdog/tap/reviewdog"
brew "sachaos/tap/viddy"
cask "1password"
cask "adoptopenjdk12"
cask "adoptopenjdk8"
cask "alacritty"
cask "alfred"
cask "android-platform-tools"
cask "bloomrpc"
cask "dbeaver-community"
cask "docker"
cask "firefox"
cask "font-hack-nerd-font"
cask "gimp"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "grammarly"
cask "iterm2"
cask "kap"
cask "lens"
cask "maccy"
cask "macfuse"
cask "mat"
cask "netnewswire"
cask "ngrok"
cask "notion"
cask "numi"
cask "postman"
cask "rectangle"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "tableplus"
cask "telegram"
cask "the-unarchiver"
cask "tor-browser"
cask "transmission"
cask "typora"
cask "virtualbox"
cask "visual-studio-code"
cask "webstorm"
cask "whatsapp"
cask "wireshark-chmodbpf"
cask "zoom"
