# Brews
brew 'act'
brew 'ankitpokhrel/jira-cli/jira-cli'
brew 'bat'
brew 'bufbuild/buf/buf'
brew 'coreutils'
brew 'csvkit'
brew 'curl'
brew 'curlie'
brew 'dive'
brew 'docker', link: false
brew 'docker-compose', link: false
brew 'docker-credential-helper-ecr', link: false
brew 'duf'
brew 'findutils'
brew 'gh'
brew 'git'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'gofumpt'
brew 'golangci/tap/golangci-lint'
brew 'goreleaser'
brew 'gromgit/fuse/sshfs-mac'
brew 'grpc'
brew 'grpcurl'
brew 'helm'
brew 'heroku/brew/heroku'
brew 'hey'
brew 'htmlq'
brew 'htop'
brew 'httpie'
brew 'ipython'
brew 'jenv'
brew 'jid'
brew 'jq'
brew 'k3d'
brew 'k9s'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kubespy'
brew 'libpq'
brew 'lux'
brew 'miller'
brew 'moshebe/pkg/gebug'
brew 'moshebe/pkg/gtrace'
brew 'neovim'
brew 'nnn'
brew 'nvm'
brew 'protobuf'
brew 'protoc-gen-go'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'reviewdog/tap/reviewdog'
brew 'rsync'
brew 'sachaos/tap/viddy'
brew 'stern'
brew 'tctl'
brew 'terraform'
brew 'tmate'
brew 'wget'
brew 'wireshark'
brew 'yamllint'
brew 'yarn'
brew 'yq'
brew 'zoxide'
brew 'age'
brew 'buf'
brew 'crane'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'jira-cli'
brew 'k6'
brew 'kubectl'
brew 'minikube'
brew 'mkcert'
brew 'neovim', args: ['HEAD']
brew 'newsboat'
brew 'nmap'
brew 'node'
brew 'protoc-gen-go-grpc'
brew 'qpdf'
brew 'ripgrep'
brew 'rust'
brew 'tig'
brew 'tree'
# brew 'vault'  # Removed: no longer available in Homebrew
brew 'watch'
brew 'tmux'
brew 'yt-dlp'  # Replaced youtube-dl (deprecated)

# Casks
cask '1password'
cask 'alacritty'
cask 'alfred'
cask 'docker'
cask 'firefox'
cask 'font-hack-nerd-font'
cask 'gimp'
cask 'github'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'grammarly-desktop'  # Renamed from grammarly
cask 'iterm2'
cask 'kap'
cask 'lens'
cask 'maccy'
cask 'macfuse'
cask 'netnewswire'
cask 'ngrok'
cask 'notion'
cask 'postman'
cask 'rectangle'
cask 'spotify'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram'
cask 'tor-browser'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'webstorm'
cask 'whatsapp'
cask 'wireshark-chmodbpf'
cask 'brave-browser'
cask 'osquery'
cask 'signal'
cask 'slack'
cask 'utm'

# Taps
tap 'ankitpokhrel/jira-cli'
tap 'bufbuild/buf'
tap 'datawire/blackbird'
tap 'golangci/tap'
tap 'goreleaser/tap'
tap 'gromgit/fuse'
tap 'moshebe/pkg'
tap 'reviewdog/tap'
tap 'hashicorp/tap'
