tap "homebrew/bundle"
tap "homebrew/cask"
tap 'homebrew/core'
tap 'homebrew/services'

brew 'asciinema'
brew 'autojump'
brew 'aws-shell'
brew 'bat'
brew 'curl'
brew 'docker'
brew 'docker-compose'
brew 'docker-credential-helper-ecr'
brew 'dog'
brew 'ffmpeg'
brew 'fswatch'
brew 'fzf'
brew 'gh'
brew 'git-delta'
brew 'git-secrets'
brew 'git'
brew 'gnupg2'
brew 'go'
brew 'goreleaser'
brew 'graphviz'
brew 'grpc'
brew 'helm'
brew 'hey'
brew 'htop'
brew 'httpie'
brew 'hugo'
brew 'ipcalc'
brew 'iperf'
brew 'ipython'
brew 'jq'
brew 'jq'
brew 'kubectl'
brew 'kubectx'
brew 'kubespy'
brew 'maccy'
brew 'mercurial'
brew 'minikube'
brew 'mitmproxy'
brew 'mkcert'
brew 'mkcert'
brew 'neovim'
brew 'neovim'
brew 'ngrok'
brew 'nmap'
brew 'nnn'
brew 'node'
brew 'node'
brew 'osquery'
brew 'protoc-gen-go'
brew 'rsync'
brew 'rust'
brew 'terraform'
brew 'tree'
brew 'vault'
brew 'watch'
brew 'yamllint'
brew 'youtube-dl'

cask 'alacritty'
cask 'alfred'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'netnewswire'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'transmission'
cask 'virtualbox'
cask 'telegram'
cask 'visual-studio-code'
cask 'whatsapp'